#include "wait.h"
#include "iodefine.h"
#include <machine.h>

volatile int wait_cnt = 0;
volatile int wait_cnt_ITP = 0;


/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：CMT1 (コンペアマッチタイマー)の初期化                                               */
/* 関 数 詳 細：1ms割り込み周期                                                                     */
/* 引       数：なし										    */
/* 戻  り   値：なし										    */
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */ 
void WAIT_init(){
    MSTP(CMT1) = 0;                // SYSTEM.MSTPCRA.BIT.MSTPA15 = 0; // CMT1 タイマースタンバイ解除 （0で解除）
    CMT1.CMCR.WORD = 0x0040;       // 4:割り込み許可　0:PCLK/8 1:PCLK/32 2:PCLK/128 3:PCLK/512
    CMT1.CMCOR = 3000-1;           // 1ms Count： PCLK = 24MHz/8=3MHz 3M/1mS=3000 (得たいカウント数-1)
    IPR(CMT1,CMI1) = 3;
    IEN(CMT1,CMI1) = 1;
    
    set_psw(0x00010000);
     
    CMT.CMSTR0.BIT.STR1 = 1;       // CMT1タイマースタート
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：1msの待ち時間 								                                          */
/* 関 数 詳 細：1msの待ち時間                        	                                            */
/* 引       数：待ち時間（ms)																	    */
/* 戻  り   値：なし																			    */
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */ 
void delay(int cnt){
    wait_cnt = 0;
    
    while(wait_cnt < cnt);
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：1msの待ち時間 								                                          */
/* 関 数 詳 細：1msの待ち時間    割り込み内で使用するバージョン              	                     */
/* 引       数：待ち時間（ms)																	    */
/* 戻  り   値：なし																			    */
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */ 
void delay_ITP(int cnt){
    wait_cnt_ITP = 0;

    while(wait_cnt_ITP < cnt);
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：CMT1割り込みモジュール                                                              */
/* 関 数 詳 細：                                                                                    */
/* 引       数：なし										    */
/* 戻  り   値：なし										    */
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
#pragma interrupt (Excep_CMT1_CMI1(vect=29))
void Excep_CMT1_CMI1(void)
{
     wait_cnt++;
	 wait_cnt_ITP++;
}